-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   zengluolu
-- @email:    1819@qq.com
-- @date:     2023-10-16
-- @module:   actor_res 
-- @describe: 物品资源
-- @version:  v1.0


-------------------------------------------------------------------------------------
-- 任务模块资源
---@class actor_res
local actor_res = {
    -- 采集资源
    GATHER_RES = {
        ['蛇谷'] = {
            ['采集'] = {

                [0x0C475373] = { gather_type = 1 },
                [0x0C475374] = { gather_type = 2 },
                [0x0C475375] = { gather_type = 3 },
            },
            ['采矿'] = {
                [0x0C475495] = { gather_type = 1 },
                [0x0C475496] = { gather_type = 2 },
                [0x0C475497] = { gather_type = 3 },
            },
            ['真气'] = {
                [0x1833175d] = {gather_type = 1},
                [0x1833175E] = {gather_type = 2},
                [0x1833175F] = {gather_type = 2},
            },
            ['宝箱'] = {
                [0x0C475431] = { gather_type = 1 },
                [0x0C475432] = { gather_type = 2 },
                [0x0C475433] = { gather_type = 3 },
            },
        },
        ['蛇妖平原'] = {
            ['采集'] = {
                [0x0C475503] = {gather_type = 1},
                [0x0C475504] = {gather_type = 2},
                [0x0C475505] = {gather_type = 3},
                [0x0C4754F9] = {gather_type = 1},
                [0x0C4754FA] = {gather_type = 2},
                [0x0C4754FB] = {gather_type = 3},
            },
            ['采矿'] = {
                [0x0C47562F] = {gather_type = 1},
                [0x0C475630] = {gather_type = 2},
                [0x0C475631] = {gather_type = 3},
            },
            ['真气'] = {
                [0x18331767] = {gather_type = 1},
                [0x18331768] = {gather_type = 2},
                [0x18331769] = {gather_type = 3},
                [0x1833176A] = {gather_type = 4},
            },
            ['宝箱'] = {
                [0x0C4755C1] = { gather_type = 1 },
                [0x0C4755C2] = { gather_type = 2 },
                [0x0C4755C3] = { gather_type = 3 },
            },
        },
        -- 没有真气
        ['绝命谷上方'] = {
            ['采集'] = {
                [0x0C475751] = {gather_type = 1},
                [0x0C475752] = {gather_type = 2},
                [0x0C475753] = {gather_type = 3},
            },
            ['采矿'] = {
                [0x0C47587D] = {gather_type = 1},
                [0x0C47587E] = {gather_type = 2},
                [0x0C47587F] = {gather_type = 3},
            },

            ['宝箱'] = {
                [0x0C475819] = { gather_type = 1 },
                [0x0C47581A] = { gather_type = 2 },
                [0x0C47581B] = { gather_type = 3 },
            },
        },
        -- 没有真气
        ['绝命谷下方'] = {
            ['采集'] = {
                [0x0C475B39] = {gather_type = 1},
                [0x0C475B3A] = {gather_type = 2},
                [0x0C475B3B] = {gather_type = 3},
            },
            ['采矿'] = {
                [0x0C475C65] = {gather_type = 1},
                [0x0C475C66] = {gather_type = 2},
                [0x0C475C67] = {gather_type = 3},
            },

            ['宝箱'] = {
                [0x0C475C01] = { gather_type = 1 },
                [0x0C475C02] = { gather_type = 2 },
                [0x0C475C03] = { gather_type = 3 },
            },
        },

        ['比奇秘谷1层'] = {
            ['采集'] = {

            },
            ['采矿'] = {
                [0x11E1F509] = { gather_type = 1 },
                [0x11E1F50A] = { gather_type = 2 },
                [0x11E1F50B] = { gather_type = 3 },
            },
            ['真气'] = {

            },
            ['宝箱'] = {
                [0x11E1F56D] = { gather_type = 1 },
                [0x11E1F56E] = { gather_type = 2 },
                [0x11E1F56F] = { gather_type = 3 },
            },






        } ,
        ['沃玛森林'] = {
            ['采集'] = {
                [0xC381129] = { gather_type = 1 },
                [0xC38112A] = { gather_type = 2 },
                [0xC38112B] = { gather_type = 3 },
                [0xC381133] = { gather_type = 1 },
                [0xC381134] = { gather_type = 2 },
                [0xC381135] = { gather_type = 3 },
            },
            ['采矿'] = {
                [0xC381255] = { gather_type = 1 },
                [0xC381256] = { gather_type = 2 },
                [0xC381257] = { gather_type = 3 },
                [0xC38125F] = { gather_type = 1 },
            },
            ['真气'] = {
                [0x1823E0D5] = { gather_type = 1 },
                [0x1823E0D6] = { gather_type = 2 },
                [0x1823E0D7] = { gather_type = 3 },
            },
            ['宝箱'] = {
                [0xC3811F1] = { gather_type = 1 },
                [0xC3811F2] = { gather_type = 2 },
                [0xC3811F3] = { gather_type = 3 },
            },
        },

        ['银杏谷'] = {
            ['采集'] = {
                [0xBFB0829] = { gather_type = 1 },
                [0xBFB082A] = { gather_type = 2 },
                [0xBFB082B] = { gather_type = 3 },
                [0xBFB0833] = { gather_type = 1 },
                [0xBFB0834] = { gather_type = 2 },
                [0xBFB0835] = { gather_type = 3 },

            },
            ['采矿'] = {
                [0xBFB0955] = { gather_type = 1 },
                [0xBFB0956] = { gather_type = 2 },
                [0xBFB0957] = { gather_type = 3 },
                [0xBFB095F] = { gather_type = 1 },
            },
            ['真气'] = {
                [0x17E6CC1D] = { gather_type = 1 },
                [0x17E6CC1E] = { gather_type = 2 },
                [0x17E6CC1F] = { gather_type = 3 },
            },
            ['宝箱'] = {
                [0xBFB08F1] = { gather_type = 1 },
                [0xBFB08F2] = { gather_type = 2 },
                [0xBFB08F3] = { gather_type = 3 },
            },
        },
        ['比奇县'] = {
            ['采集'] = {
                [0xC198CA9] = { gather_type = 1 },
                [0xC198CAA] = { gather_type = 2 },
                [0xC198CAB] = { gather_type = 3 },

                [0xC198CB3] = { gather_type = 1 },
                [0xC198CB4] = { gather_type = 2 },
                [0xC198CB5] = { gather_type = 3 },
            },
            ['采矿'] = {
                [0xC198DD5] = { gather_type = 1 },
                [0xC198DD6] = { gather_type = 2 },
                [0xC198DD7] = { gather_type = 3 },
                [0xC198DDF] = { gather_type = 1 },
            },
            ['真气'] = {
                [0x1805509D] = { gather_type = 1 },
                [0x1805509E] = { gather_type = 2 },
                [0x1805509F] = { gather_type = 3 },
            },
            ['宝箱'] = {
                [0xC198D71] = { gather_type = 1 },
                [0xC198D72] = { gather_type = 2 },
                [0xC198D73] = { gather_type = 3 },
            },
        },
        ['半兽古墓1层'] = {
            ['采集'] = {
                [0xC28CEE9] = { gather_type = 1 },
                [0xC28CEEA] = { gather_type = 2 },
                [0xC28CEEB] = { gather_type = 3 },
                [0xC28CEF3] = { gather_type = 1 },
                [0xC28CEF4] = { gather_type = 2 },
                [0xC28CEF5] = { gather_type = 3 },

            },
            ['采矿'] = {
                [0xC28D015] = { gather_type = 1 },
                [0xC28D016] = { gather_type = 2 },
                [0xC28D017] = { gather_type = 3 },
            },
            ['真气'] = {

            },
            ['宝箱'] = {
                [0xC28CFB1] = { gather_type = 1 },
                [0xC28CFB2] = { gather_type = 2 },
                [0xC28CFB3] = { gather_type = 3 },
            },
        },
        ['半兽古墓2层'] = {
            ['采集'] = {
                [0xC28D2D1] = { gather_type = 1 },
                [0xC28D2D2] = { gather_type = 2 },
                [0xC28D2D3] = { gather_type = 3 },
            },
            ['采矿'] = {
                [0xC28D3FD] = { gather_type = 1 },
                [0xC28D3FE] = { gather_type = 2 },
                [0xC28D3FF] = { gather_type = 3 },
            },
            ['真气'] = {

            },
            ['宝箱'] = {
                [0xC28D399] = { gather_type = 1 },
                [0xC28D39A] = { gather_type = 2 },
                [0xC28D39B] = { gather_type = 3 },
            },
        },
        ['半兽人遗迹1层'] = {
            ['采集'] = {
                [0xC28D6B9] = { gather_type = 1 },
                [0xC28D6BA] = { gather_type = 2 },
                [0xC28D6BB] = { gather_type = 3 },

                [0xC28D6C3] = { gather_type = 1 },
                [0xC28D6C4] = { gather_type = 2 },
                [0xC28D6C5] = { gather_type = 3 },

            },
            ['采矿'] = {
                [0xC28D7E5] = { gather_type = 1 },
                [0xC28D7E6] = { gather_type = 2 },
                [0xC28D7E7] = { gather_type = 3 },

            },
            ['真气'] = {

            },
            ['宝箱'] = {
                [0xC28D781] = { gather_type = 1 },
                [0xC28D782] = { gather_type = 2 },
                [0xC28D783] = { gather_type = 3 },
            },
        },
        ['半兽人遗迹2层'] = {
            ['采集'] = {

                [0xC28DAA1] = { gather_type = 1 },
                [0xC28DAA2] = { gather_type = 2 },
                [0xC28DAA3] = { gather_type = 3 },
            },
            ['采矿'] = {
                [0xC28DBCD] = { gather_type = 1 },
                [0xC28DBCE] = { gather_type = 2 },
                [0xC28DBCF] = { gather_type = 3 },
            },
            ['真气'] = {

            },
            ['宝箱'] = {
                [0xC28DB69] = { gather_type = 1 },
                [0xC28DB6A] = { gather_type = 2 },
                [0xC28DB6B] = { gather_type = 3 },
            },
        },
        ['沃玛山'] = {
            ['采集'] = {

                [0x0C3818F9] = {gather_type = 1},
                [0x0C3818FA] = {gather_type = 2},
                [0x0C3818FB] = {gather_type = 3},

                [0x0C381903] = {gather_type = 1},
                [0x0C381904] = {gather_type = 2},
                [0x0C381905] = {gather_type = 3},
            },
            ['采矿'] = {
                [0x0C381A2F] = {gather_type = 1},
                [0x0C381A25] = {gather_type = 1},
                [0x0C381A26] = {gather_type = 2},
                [0x0C381A27] = {gather_type = 3},
            },
            ['真气'] = {
                [0x1823E8A5] = {gather_type = 1},
                [0x1823E8A6] = {gather_type = 2},
                [0x1823E8A7] = {gather_type = 3},
                [0x1823E8A8] = {gather_type = 4},
            },
            ['宝箱'] = {
                [0x0C3819C1] = { gather_type = 1 },
                [0x0C3819C2] = { gather_type = 2 },
                [0x0C3819C3] = { gather_type = 3 },
            },
        },

    },
    --沃玛森林 银杏谷 比奇县 半兽古墓1层 半兽古墓2层 半兽人遗迹1层  半兽人遗迹2层
   -- { session = '基本设置', key = '采集地图', value =





    -- C角色
    -- redis  银杏谷 1  -- A角色
    -- redis  银杏谷 2  -- B角色

    -- 秘境峰

    -- 组队

    -- 地图资源
    GATHER_MAP_LIST = {
        ['沃玛山'] = {
            [1] = { map_id = 102004050.0, map_name = '沃玛山', pos = { x = -15334.473632812, y = -15970.978515625, z = -2486.6083984375 } },
            [2] = { map_id = 102004050.0, map_name = '沃玛山', pos = { x = 3245.9113769531, y = 8690.1787109375, z = 2405.4921875 } },
            [3] = { map_id = 102004050.0, map_name = '沃玛山', pos = { x = 3977.5690917969, y = 4031.3073730469, z = 3272.3115234375 } },
            [4] = { map_id = 102004050.0, map_name = '沃玛山', pos = { x = 3056.2248535156, y = -9361.765625, z = 2154.0979003906 } },
        },
        ['蛇谷'] = {
            [1] = { map_id = 103003010.0, map_name = '蛇谷', pos = { x = 12179.71875, y = 12307.578125, z = 356.6891784668 } },
            [2] = { map_id = 103003010.0, map_name = '蛇谷', pos = { x = 15812.536132812, y = -11294.120117188, z = 623.74926757812 } },
            [3] = { map_id = 103003010.0, map_name = '蛇谷', pos = { x = 1432.4719238281, y = 40.249927520752, z = -3614.5642089844 } },
            [4] = { map_id = 103003010.0, map_name = '蛇谷', pos = { x = -16442.705078125, y = 11832.576171875, z = 849.52777099609 } },
            [5] = { map_id = 103003010.0, map_name = '蛇谷', pos = { x = -16070.135742188, y = -11560.265625, z = 223.29652404785 } },
            [6] = { map_id = 103003010.0, map_name = '蛇谷', pos = { x = -5064.12890625, y = -1876.6031494141, z = 239.65116882324 } },
        },
        ['蛇妖平原'] = {
            [1] = { map_id = 103003070.0, map_name = '蛇妖平原', pos = { x = -19917.8828125, y = 24467.138671875, z = 801.88507080078 } },
            [2] = { map_id = 103003070.0, map_name = '蛇妖平原', pos = { x = 24152.404296875, y = 25984.068359375, z = 2403.2277832031 } },
            [3] = { map_id = 103003070.0, map_name = '蛇妖平原', pos = { x = 28625.15625, y = 12207.375, z = 451.02969360352 } },
            [4] = { map_id = 103003070.0, map_name = '蛇妖平原', pos = { x = 26002.44921875, y = -24119.806640625, z = 3072.6638183594 } },
            [5] = { map_id = 103003070.0, map_name = '蛇妖平原', pos = { x = -21273.85546875, y = -22113.798828125, z = 1432.4571533203 } },
            [6] = { map_id = 103003070.0, map_name = '蛇妖平原', pos = { x = -13441.9609375, y = -17001.439453125, z = -3694.2111816406 } },
            [7] = { map_id = 103003070.0, map_name = '蛇妖平原', pos = { x = -21778.162109375, y = 5323.0131835938, z = -407.16061401367 } },
            [8] = { map_id = 103003070.0, map_name = '蛇妖平原', pos = { x = 1537.98828125, y = -7742.271484375, z = -387.80932617188 } },
            [9] = { map_id = 103003070.0, map_name = '蛇妖平原', pos = { x = 3244.77734375, y = 16152.765625, z = -3768.2172851562 } },
        },
        ['绝命谷上方'] = {
            [1] = { map_id = 103003020.0, map_name = '绝命谷上方', pos = { x = -19385.2421875, y = 11103.723632812, z = 1649.9774169922 } },
            [2] = { map_id = 103003020.0, map_name = '绝命谷上方', pos = { x = 21030.794921875, y = 15030.651367188, z = 405.29220581055 } },
            [3] = { map_id = 103003020.0, map_name = '绝命谷上方', pos = { x = 36319.7109375, y = 4274.576171875, z = 221.48452758789 } },
            [4] = { map_id = 103003020.0, map_name = '绝命谷上方', pos = { x = 28237.431640625, y = -16111.366210938, z = 999.22528076172 } },
            [5] = { map_id = 103003020.0, map_name = '绝命谷上方', pos = { x = 17025.072265625, y = 971.11547851562, z = 1154.4542236328 } },
            [6] = { map_id = 103003020.0, map_name = '绝命谷上方', pos = { x = 10547.33984375, y = 2667.23828125, z = -88.06453704834 } },
            [7] = { map_id = 103003020.0, map_name = '绝命谷上方', pos = { x = 5514.6772460938, y = -8171.6333007812, z = 981.53509521484 } },
            [8] = { map_id = 103003020.0, map_name = '绝命谷上方', pos = { x = -5118.6220703125, y = -13901.215820312, z = 1085.5113525391 } },
            [9] = { map_id = 103003020.0, map_name = '绝命谷上方', pos = { x = 4557.609375, y = -23887.2265625, z = 2048.5654296875 } },
        },
        ['绝命谷下方'] = {
            [1] = { map_id = 103003030.0, map_name = '绝命谷下方', pos = { x = -16475.666015625, y = -8600.4375, z = 2023.7189941406 } },
            [2] = { map_id = 103003030.0, map_name = '绝命谷下方', pos = { x = -17569.501953125, y = 5367.046875, z = 2659.6157226562 } },
            [3] = { map_id = 103003030.0, map_name = '绝命谷下方', pos = { x = 6345.0346679688, y = 12172.233398438, z = 2026.8754882812 } },
            [4] = { map_id = 103003030.0, map_name = '绝命谷下方', pos = { x = 26941.3359375, y = 7134.01953125, z = 1329.0662841797 } },
            [5] = { map_id = 103003030.0, map_name = '绝命谷下方', pos = { x = 31569.1171875, y = -10030.8515625, z = 847.86895751953 } },
            [6] = { map_id = 103003030.0, map_name = '绝命谷下方', pos = { x = -6781.283203125, y = -16755.232421875, z = 2548.4580078125 } },
            [7] = { map_id = 103003030.0, map_name = '绝命谷下方', pos = { x = 1025.763671875, y = 1412.390625, z = 99.786659240723 } },
            [8] = { map_id = 103003030.0, map_name = '绝命谷下方', pos = { x = 16974.97265625, y = -7250.1967773438, z = 2022.1939697266 } },
            [9] = { map_id = 103003030.0, map_name = '绝命谷下方', pos = { x = 13394.55859375, y = -15836.61328125, z = 1746.1049804688 } },
        },
        ['比奇秘谷1层'] =  {
            [1] = { map_id = 201003010.0, map_name = '比奇秘谷1层', pos = { x = 9861.58984375, y = -16858.48828125, z = 786.12438964844 } },
            [2] =  { map_id = 201003010.0, map_name = '比奇秘谷1层', pos = { x = 13893.859375, y = 15815.49609375, z = 4176.4370117188 } },
            [3] =  { map_id = 201003010.0, map_name = '比奇秘谷1层', pos = { x = -10228.376953125, y = 15421.34375, z = 3227.9614257812 } },
            [4] =  { map_id = 201003010.0, map_name = '比奇秘谷1层', pos = { x = -16456.021484375, y = -16978.134765625, z = 2309.0131835938 } },
            [5] = { map_id = 201003010.0, map_name = '比奇秘谷1层', pos = { x = 4749.4765625, y = -2000.275390625, z = 1522.9899902344 } },
        },
        ['沃玛森林'] = {
            [1] = { map_id = 102003010.0, map_name = '沃玛森林', pos = { x = -16899.595703125, y = -27366.78515625, z = 4888.7592773438 } },
            [2] = { map_id = 102003010.0, map_name = '沃玛森林', pos = { x = -5448.3984375, y = -17369.84375, z = 5472.4174804688 } },
            [3] = { map_id = 102003010.0, map_name = '沃玛森林', pos = { x = -7432.4736328125, y = -3672.8481445312, z = 4756.1645507812 } },
            [4] = { map_id = 102003010.0, map_name = '沃玛森林', pos = { x = -14083.359375, y = 10271.100585938, z = 4999.9770507812 } },
            [5] = { map_id = 102003010.0, map_name = '沃玛森林', pos = { x = -25604.58984375, y = 13274.366210938, z = 5742.4750976562 } },
            [6] = { map_id = 102003010.0, map_name = '沃玛森林', pos = { x = -39019.8203125, y = 1895.2900390625, z = 5727.6401367188 } },
            [7] = { map_id = 102003010.0, map_name = '沃玛森林', pos = { x = -38094.21875, y = -9200.1650390625, z = 5298.5888671875 } },
            [8] = { map_id = 102003010.0, map_name = '沃玛森林', pos = { x = -28871.314453125, y = -8194.6484375, z = 5493.5229492188 } },

        },
        ['银杏谷'] = {
            [1] = { map_id = 101003010.0, map_name = '银杏谷', pos = { x = 22105.359375, y = 4794.82421875, z = 3857.6513671875 } },
            [2] = { map_id = 101003010.0, map_name = '银杏谷', pos = { x = -3101.6796875, y = -9083.384765625, z = 3924.9675292969 } },
            [3] = { map_id = 101003010.0, map_name = '银杏谷', pos = { x = 16938.3203125, y = -22418.38671875, z = 2548.4963378906 } },
            [4] = { map_id = 101003010.0, map_name = '银杏谷', pos = { x = 8520.3603515625, y = 8694.826171875, z = 2499.4340820312 } },
            [5] = { map_id = 101003010.0, map_name = '银杏谷', pos = { x = -10614.639648438, y = -21450.17578125, z = 4009.3205566406 } },
        },
        ['比奇县'] = {
            [1] = { map_id = 101003030.0, map_name = '比奇县', pos = { x = -15875.004882812, y = -4593.8369140625, z = -20436.056640625 } },
            [2] = { map_id = 101003030.0, map_name = '比奇县', pos = { x = -6810.0009765625, y = -185.0, z = -20421.748046875 } },
            [3] = { map_id = 101003030.0, map_name = '比奇县', pos = { x = 8076.583984375, y = -29863.796875, z = -20749.037109375 } },
            [4] = { map_id = 101003030.0, map_name = '比奇县', pos = { x = -29823.416015625, y = -18928.796875, z = -18767.984375 } },
            [5] = { map_id = 101003030.0, map_name = '比奇县', pos = { x = 5809.419921875, y = -22328.58984375, z = -19049.572265625 } },
        },
        ['半兽古墓1层'] = {
            [1] = { map_id = 101004010.0, map_name = '半兽古墓1层', pos = { x = 251.79878234863, y = -16103.620117188, z = 2713.4331054688 } },
            [2] = { map_id = 101004010.0, map_name = '半兽古墓1层', pos = { x = -1646.2766113281, y = -251.63102722168, z = 1988.6475830078 } },
            [3] = { map_id = 101004010.0, map_name = '半兽古墓1层', pos = { x = -17287.45703125, y = -1406.2802734375, z = 1965.634765625 } },
            [4] = { map_id = 101004010.0, map_name = '半兽古墓1层', pos = { x = -18050.0, y = -10765.0, z = 1929.7220458984 } },
            [5] = { map_id = 101004010.0, map_name = '半兽古墓1层', pos = { x = -24191.1796875, y = -2720.2709960938, z = 1924.6572265625 } },
            [6] = { map_id = 101004010.0, map_name = '半兽古墓1层', pos = { x = -35992.09765625, y = -15158.270507812, z = 957.16784667969 } },
            [7] = { map_id = 101004010.0, map_name = '半兽古墓1层', pos = { x = -21101.83203125, y = -16786.875, z = 1228.4056396484 } },
        },
        ['半兽古墓2层'] = {
            [1] = { map_id = 101004020.0, map_name = '半兽古墓2层', pos = { x = -17671.9765625, y = 8579.5693359375, z = 1455.7235107422 } },
            [2] = { map_id = 101004020.0, map_name = '半兽古墓2层', pos = { x = -4593.185546875, y = 6545.0078125, z = 2263.3442382812 } },
            [3] = { map_id = 101004020.0, map_name = '半兽古墓2层', pos = { x = 7474.943359375, y = 1553.4689941406, z = 987.96514892578 } },
            [4] = { map_id = 101004020.0, map_name = '半兽古墓2层', pos = { x = 19327.6875, y = 8550.037109375, z = 1926.154296875 } },
            [5] = { map_id = 101004020.0, map_name = '半兽古墓2层', pos = { x = 16861.833984375, y = -719.11145019531, z = 1501.6556396484 } },
            [6] = { map_id = 101004020.0, map_name = '半兽古墓2层', pos = { x = 19479.23046875, y = -7844.51953125, z = 2264.2807617188 } },
        },
        ['半兽人遗迹1层'] = {
            [1] = { map_id = 101004030.0, map_name = '半兽人遗迹1层', pos = { x = -14109.37109375, y = 6431.384765625, z = 2634.7570800781 } },
            [2] = { map_id = 101004030.0, map_name = '半兽人遗迹1层', pos = { x = -19350.24609375, y = -7877.1640625, z = 3268.1882324219 } },
            [3] = { map_id = 101004030.0, map_name = '半兽人遗迹1层', pos = { x = -10182.193359375, y = -9898.4716796875, z = 2361.2351074219 } },
            [4] = { map_id = 101004030.0, map_name = '半兽人遗迹1层', pos = { x = -6067.3984375, y = -2174.203125, z = 3354.3303222656 } },
            [5] = { map_id = 101004030.0, map_name = '半兽人遗迹1层', pos = { x = 4400.0703125, y = -2823.90625, z = 4909.0810546875 } },
            [6] = { map_id = 101004030.0, map_name = '半兽人遗迹1层', pos = { x = 10687.162109375, y = 13758.86328125, z = 4274.2646484375 } },
            [7] = { map_id = 101004030.0, map_name = '半兽人遗迹1层', pos = { x = 20859.26171875, y = -3834.5625, z = 4405.7075195312 } },
            [8] = { map_id = 101004030.0, map_name = '半兽人遗迹1层', pos = { x = 1440.306640625, y = -8887.8203125, z = 6331.5068359375 } },
        },
        ['半兽人遗迹2层'] = {
            [1] = { map_id = 101004040.0, map_name = '半兽人遗迹2层', pos = { x = -12230.299804688, y = 8017.080078125, z = 1600.5662841797 } },
            [2] = { map_id = 101004040.0, map_name = '半兽人遗迹2层', pos = { x = -12547.928710938, y = -9897.447265625, z = 3067.1662597656 } },
            [3] = { map_id = 101004040.0, map_name = '半兽人遗迹2层', pos = { x = 5719.6357421875, y = -12845.1171875, z = 2917.8400878906 } },
            [4] = { map_id = 101004040.0, map_name = '半兽人遗迹2层', pos = { x = 1502.3251953125, y = -3568.0817871094, z = 1987.7900390625 } },
            [5] = { map_id = 101004040.0, map_name = '半兽人遗迹2层', pos = { x = 1519.8687744141, y = 9241.734375, z = 3823.2280273438 } },
            [6] = { map_id = 101004040.0, map_name = '半兽人遗迹2层', pos = { x = 10258.154296875, y = 4141.951171875, z = 3166.1110839844 } },
            [7] = { map_id = 101004040.0, map_name = '半兽人遗迹2层', pos = { x = 15022.66015625, y = -6721.1123046875, z = 3252.908203125 } },
        },
    }


}

local this = actor_res

------------------------------------------------------------------------------
-- 判断点是否在多边形内部
-- @param pointX 点的X坐标
-- @param pointY 点的Y坐标
-- @param polygon 多边形的顶点坐标表 { {x = x1, y = y1}, {x = x2, y = y2}, ... }
-- @return boolean 点是否在多边形内部
function actor_res.is_point_in_polygon(pointX, pointY, polygon)
    local isInPolygon = false
    local j = #polygon
    for i = 1, #polygon do
        local px1, py1, px2, py2 = polygon[i].x, polygon[i].y, polygon[j].x, polygon[j].y
        if (py1 < pointY and py2 >= pointY) or (py2 < pointY and py1 >= pointY) then
            if px1 + (pointY - py1) / (py2 - py1) * (px2 - px1) < pointX then
                isInPolygon = not isInPolygon
            end
        end
        j = i
    end
    return isInPolygon
end






-------------------------------------------------------------------------------------
-- 返回对象
return actor_res

-------------------------------------------------------------------------------------