-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   zengluolu
-- @email:    1819@qq.com
-- @date:     2023-10-16
-- @module:   gather_res 
-- @describe: 采集资源
-- @version:  v1.0


-------------------------------------------------------------------------------------
-- 任务模块资源
---@class gather_res
local gather_res = {
    -- 采集草地图跑图点位
    MAP_RUN_POINT = {
        ['银杏谷'] = {
            { x = 8516, y = 7960, z = 2488 },
            { x = -5534, y = -19366, z = 3971 },
        },
    },

    MAP_RESOURCE_NAME = {
        [0x17E6CC1D] = 1, -- 白色气res_id
        [0x17E6CC1E] = 2, -- 绿色气res_id
        [0x17E6CC1F] = 3, -- 蓝色气res_id

        [0x0BFB0829] = 1, -- 白色草res_id 有不同
        [0x0BFB0833] = 1, -- 白色草res_id
        [0x0BFB0834] = 2, -- 绿色草res_id
        [0x0BFB082A] = 2, -- 绿色草res_id
        [0x0BFB082B] = 3, -- 蓝色草res_id

        [0x0BFB095F] = 1, -- 白色矿res_id
        [0x0BFB0956] = 2, -- 绿色矿res_id

    },

    RESOURCE_TYPE = {
        ['草'] = 1,
        ['矿'] = 2,
        ['宝箱'] = 3,
        ['气'] = 4,
    },

}

local this = gather_res



-------------------------------------------------------------------------------------
-- 返回对象
return gather_res

-------------------------------------------------------------------------------------