-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   zengluolu
-- @email:    1819@qq.com
-- @date:     2023-10-16
-- @module:   item_res 
-- @describe: 物品资源
-- @version:  v1.0


-------------------------------------------------------------------------------------
-- 任务模块资源
---@class item_res
local item_res = {
    -- 物品品质
    QUALITY = {
        ['普通'] = 1,
        ['高级'] = 2,
        ['稀有'] = 3,
        ['英雄'] = 4,
        ['传说'] = 5,
    },

    SELL_ITEM = {
        -- 模糊删除
        MOHU = {
            '魔物元气', '魔物结晶', '首领的邪念', '首领魂石',
        },
        QUAN = {
            '禁生酒', '毒花酒', '英雄空青石乳', '英雄青魔鬼石', '稀有木灵草',
            '高级血魂结晶', '高级武魂结晶', '高级飞魂结晶', '稀有月矿石',
            '高级武戟残片', '高级日戟残片', '高级月戟残片', '高级星戟残片',
            '回城卷轴', '高级凝集黑暗强化石', '高级神龙强化石',
            '矿石碎片', '角碎片', '蘑菇碎片', '茎干碎片', '闪粉', '生命精华', '月矿石', '净魂石',
        },
    },
    USE_ITEM = {
        QUAN = {
            '首领讨伐入场券',
            '魔方阵入场券',
            '讨伐入场券',
            '稀有材料箱',
            '高级摧毁魔石箱',
            '高级未鉴定宝牌',
            '稀有材料箱',
        },
        MOHU = {
            '活力丹',
            '达成奖励宝盒',
            '背包扩充券',
        },
    },
    -- 召唤资源
    ZHAOHUAN = {
        ['神龙材料召唤券'] = { nid = 5 },
        ['龙鳞召唤券'] = { nid = 3 },
        ['龙皮召唤券'] = { nid = 4 },
        ['龙角召唤券'] = { nid = 6 },
        ['龙爪召唤券'] = { nid = 7 },
        ['龙眼召唤券'] = { nid = 8 },
        ['龙珠召唤券'] = { nid = 14 },
        ['传说精灵石召唤券'] = { nid = 13 },
        ['精灵石召唤券'] = { nid = 0 },
        ['武功秘籍召唤券'] = { nid = 1 },
        ['魔石召唤券'] = { nid = 9 },
        ['精灵宝物召唤券'] = { nid = 10 },
        ['宝鉴武具召唤券'] = { nid = 11 },
        ['宝牌召唤券'] = { nid = 12 },
    },
    -- 时装
    FASHION = {
        -- 0x1925A, -- 战士铁片甲
        -- 0x318FA, --法师
        -- 0x49F9A, --道士
        -- 0x7ACDA, --武士
        ['密行巫服交换券'] = 0x6263A,
    }

}

local this = item_res




-------------------------------------------------------------------------------------
-- 返回对象
return item_res

-------------------------------------------------------------------------------------