-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   zengluolu
-- @email:    1819@qq.com
-- @date:     2023-10-16
-- @module:   pet_res 
-- @describe: 物品资源
-- @version:  v1.0


-------------------------------------------------------------------------------------
-- 任务模块资源
---@class pet_res
local pet_res = {

    -- 宠物列表
    PET_LIST = {
        ['河马法师波优波优'] = { power = 230, quality = 1 },
        ['青海鬼王丹丹'] = { power = 230, quality = 1 },
        ['短铁甲忠将翼德'] = { power = 230, quality = 1 },
        ['兔子道士聪聪'] = { power = 270, quality = 1 },
        ['犬大人旺旺萌'] = { power = 270, quality = 1 },
        ['武神猫头云长'] = { power = 270, quality = 1 },
        ['天尊喵特昂'] = { power = 270, quality = 1 },
        ['变脸师叉叉'] = { power = 270, quality = 1 },
        ['黑邪尊毛思罗'] = { power = 310, quality = 1 },
        ['烛火小灯笼'] = { power = 310, quality = 1 },
        ['乌龙先生牛牛'] = { power = 310, quality = 1 },

        ['小青龙浩龙'] = { power = 1440, quality = 2 },
        ['千年狐狸阳阳'] = { power = 1440, quality = 2 },
        ['红狼汪汪'] = { power = 1500, quality = 2 },
        ['无双突击海奉先'] = { power = 1500, quality = 2 },
        ['吃货猪豕豕'] = { power = 1500, quality = 2 },
        ['绿林天使花冠'] = { power = 1500, quality = 2 },
        ['青明阿卡'] = { power = 1560, quality = 2 },
        ['三尾狐雪兰'] = { power = 1600, quality = 2 },
        ['追魂使者油灯'] = { power = 1600, quality = 2 },
        ['金翅雀萌萌'] = { power = 1600, quality = 2 },
        ['蛮横道人塔坤'] = { power = 1600, quality = 2 },
        ['吸血蝙蝠吸吸'] = { power = 1640, quality = 2 },

        ['火恶魔火牛角'] = { power = 3750, quality = 3 },
        ['夜光宝石花螳螂'] = { power = 3656, quality = 3 },
        ['金翅鸟伽楼罗'] = { power = 4450, quality = 3 },
        ['倾国之色维也纳'] = { power = 3460, quality = 3 },
        ['白花孔雀明庆'] = { power = 4050, quality = 3 },
        ['福喵胖胖'] = { power = 3834, quality = 3 },
        ['宝石爱好者小小'] = { power = 3830, quality = 3 },
        ['刺客喵喵郎'] = { power = 3364, quality = 3 },
        ['雷怪兽巴拉坦'] = { power = 4360, quality = 3 },
        ['火恶魔火牛角'] = { power = 3750, quality = 3 },
        ['灵魂收割者黑阎罗'] = { power = 4420, quality = 3 },
        ['火焰妖魔飞妖狐'] = { power = 3570, quality = 3 },
        ['邪茨霸王坤'] = { power = 3622, quality = 3 },
        ['野蛮斗士恋歌'] = { power = 3440, quality = 3 },
        ['光明龙传奇'] = { power = 4200, quality = 3 },
        ['春之传令姚菲'] = { power = 4330, quality = 3 },
    },
    PET_EQUIP = {
        ['穷豚的磨刀石'] = {},
        ['豚豚的磨刀石'] = {},
        ['花猪雕像'] = {},
        ['猪雕像'] = {},
        ['紫青铃'] = {},
        ['百年貂鼠的元气'] = {},
        ['百年貂鼠的如意珠'] = {},
        ['千年果果实'] = {},
        ['古老的千年果果实'] = {},
        ['古老的千年果叶'] = {},
        ['冤魂的结晶残片'] = {},
        ['冤灵符咒'] = {},
        ['魔教修炼书'] = {},
        ['摧毁结晶残片'] = {},
        ['魔力结晶残片'] = {},
        ['魔教秘籍'] = {},
        ['生灵的符咒'] = {},
        ['褪色的竹笛'] = {},
        ['褪色的白虎珠'] = {},
        ['褪色的玄武珠'] = {},
        ['褪色的朱雀珠'] = {},
        ['冤魂符咒'] = {},
        ['蛇妖族长的逆鳞'] = {},
        ['半兽人角笛'] = {},
        ['触龙神皮'] = {},
        ['无尽的赤月魔剑'] = {},
        ['冤魂的结晶石'] = {},
        ['竹笛'] = {},
        ['活力结晶残片'] = {},
        ['活力结晶石'] = {},
        ['魔力结晶石'] = {},
        ['摧毁结晶石'] = {},
        ['无圣的赤月魔剑'] = {},
        ['无尽的天星甲'] = {},
        ['褪色的雷铃'] = {},
        ['无尽的太极牌'] = {},
        ['无圣的太极牌'] = {},
        ['褪色的紫青铃'] = {},
        ['雷铃'] = {},
        ['白虎珠'] = {},
        ['玄武珠'] = {},
        ['威龙神皮'] = {},
        ['半兽人突击队长的角笛'] = {},
        ['蛇妖女王的逆鳞'] = {},

        ['疾风镐头'] = { name = {'绿林天使花冠', '兔子道士聪聪'} },
        ['风镐'] = { {name = '绿林天使花冠', '兔子道士聪聪'}},
        ['嗜魂镐头'] = { name ={ '绿林天使花冠', '兔子道士聪聪'} },
    },


}

local this = pet_res



-------------------------------------------------------------------------------------
-- 返回对象
return pet_res

-------------------------------------------------------------------------------------