-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   zengluolu
-- @email:    1819@qq.com
-- @date:     2023-10-16
-- @module:   quest_res 
-- @describe: 物品资源
-- @version:  v1.0


-------------------------------------------------------------------------------------
-- 任务模块资源
---@class quest_res
local quest_res = {
    -- 主线任务
    MAIN_QUEST = {
        [1] = { name = '漆黑的密道' },
        [2] = { name = '漆黑的密道', },
        [3] = { name = '危险的救援计划', },
        [4] = { name = '武功修炼', },
        [5] = { name = '岁月静好', },
        [6] = { name = '燃烧的桃花谷', },
        [7] = { name = '追踪痕迹', },
        [8] = { name = '黑暗之影', },
        [9] = { name = '芊菲的下落', },
        [10] = { name = '寻求灵药', },
        [11] = { name = '逃离银杏谷', },
        [12] = { name = '比奇城风云', },
        [13] = { name = '再遭绑架的芊菲', },
        [14] = { name = '绑架的背后', },
        [15] = { name = '半兽古墓', },
        [16] = { name = '石室之秘', },
        [17] = { name = '师父的决断', },
        [18] = { name = '偶然发现的远古迷宫', },
        [19] = { name = '可疑的随行', },
        [20] = { name = '半兽人遗迹宝物', },
        [21] = { name = '访问仙界精灵村', },
        [22] = { name = '重重危险', },
        [23] = { name = '江湖缘分', }, -- 沃玛森林
        [24] = { name = '牛魔神殿的怪事', },
        [25] = { name = '被绑架的女人们', },
        [26] = { name = '吸星大法之秘', },
        [27] = { name = '寻找龙身', },
        [28] = { name = '芊菲的下落Ⅰ', },
        [29] = { name = '隐士谷的隐藏高手', },
        [30] = { name = '毒蛇魔女与芊菲公主' }, --idx 6  达到40级
    },
    -- 采集任务
    GATHER_QUEST = {
        ['在银杏谷采集'] = '采集',
        ['在银杏谷采矿'] = '采矿',
        ['采集的乐趣'] = '采集',
        ['采矿的乐趣'] = '采矿',
        ['在比奇县采集'] = '采集',
        ['在比奇县采矿'] = '采矿',
        ['在沃玛森林采集'] = '采集',
        ['在沃玛森林采矿'] = '采矿',
        ['真气收集者'] = '真气',
        ['隐藏宝物'] = '宝箱',
        ['新力量源泉'] = '真气',
        ['某人的宝物'] = '宝箱',
        ['碎渣宝物'] = '宝箱',
    },
    WEITUO_GATHER_QUEST = {
        ['宝物的气息'] = '真气',
        ['勉强的工作'] = '采集',
        ['莫夜的宝物'] = '宝箱',
        ['底层人的隐情'] = '采矿'
    },

    SIDE_QUEST = {
        ['野外'] = {
            ['银杏谷'] = { '黑云耍威风', '清除有害植物', '饿鬼不速之客', '其他毒的材料', '张氏的嘱托', '维护银杏谷的治安', '解铃还须系铃人', '银杏谷屠杀者', '机动打击', '研究蛇妖族毒术', '打压蛇妖族气势' }, -- '采集的乐趣','在银杏谷采集','在银杏谷采矿'
            ['比奇城后巷'] = { '以眼还眼', '血的代价', '后巷痞子', '歹毒高利贷', '双门帮监视队长', '监视兵的痕迹', '以牙还牙', '比奇城后巷的屠杀者', '双门帮掠夺队长', '掠夺兵的宝物' },
            ['比奇县'] = { '掠夺强盗', '掌握犯人', '比奇县屠杀者', '善良地活着' }, -- '猛兽的证据', '调查通缉犯', '讨伐赤狼队'
            ['半兽古墓1层'] = { '寻找线索', '墓地看守人', '确认毒雾原因', '跟随生灵的团伙', '半兽古墓1层屠杀者', '消失的宝物' },
            ['半兽古墓2层'] = { '守护不利之罪', '血海深仇', '屠杀元凶', '半兽古墓2层屠杀者', '半兽人之力' },
            ['半兽人遗迹1层'] = { '恢复原状', '危险的巨大禽兽', '保护古迹', '半兽人之怒', '真正的盗墓贼', '半兽人遗迹1层屠杀者', '盗墓贼的隐情' }, --, '某人的宝物'
            ['半兽人遗迹2层'] = { '活尸之夜', '剧毒蜘蛛', '事已至此的骚乱', '愤愤不平的半兽人', '半兽人遗迹2层屠杀者', '消失的宝物', '可用的武器', '守护不利之罪' }, --'碎渣宝物',
            ['沃玛森林'] = { '一丝不苟的门卫', '沃玛的食材', '危险的家伙们', '危险的存在', '猛兽', '牛魔逃亡者', '牛魔追踪者', '奇怪的妖怪', '蘑菇妖怪' },
            ['牛魔神殿1层'] = { '屠杀元凶', '突变体牛魔族', '珍奇的甲胄', '钝化的武器', '材料商的嘱托', '红色沃玛战士', '沃玛战士训练兵', '武器商的嘱托', },-- '红帽子'
            ['牛魔神殿2层'] = { '监视女人的家伙们', '结婚之日', '警卫兵的指令', '平息女人们的仇怨', '玄黑沃玛', '红色沃玛', '红色沃玛勇士', '苍蓝沃玛勇士', '玄黑沃玛勇士', '神殿管理员', '沃玛的魔力', '沃玛的印章', '沃玛之力' },
            ['牛魔神殿3层'] = { '突破牛魔神殿', '庞然大物', '巨型守护鬼看守人', '恶毒的猪妖群', '叛乱者', '猪妖监视官', '猪妖打手', '通往牛魔神的关口', '可疑地图', '调查可疑武器', '守护兵的指令', '粗糙的东西', '远古沃玛的痕迹', '猪妖叛乱军', '猪妖管理员' },
        },
        ['精英'] = {
            ['比奇城后巷'] = { '双门四天王1', '双门四天王2', '双门四天王3', '双门四天王4', '丹鹰的护卫部队', '朱千的护卫部队', '千秋风的护卫部队', '白健的护卫部队', '双门帮高手1', '双门帮高手2', '双门帮高手3', '双门帮高手4', '双门帮帮主', '毁灭侦察队', '毁灭守护队', '帮主信物', '双门帮侦察队长', '双门帮守护队长', '双门帮顶尖高手', },
            ['半兽古墓1层'] = { '玄黑半兽人佣兵队长', '玄黑半兽人长老', '佣兵队长部下们', '窟落部下们', '佣兵队长信物', '窟落信物', '玄黑半兽人驯兽师', '玄黑半兽人注视者', '玄黑部族长', '紫侃部下们', '焰鬼部下们', '紫侃信物', '焰鬼信物' },
            ['半兽古墓2层'] = { '黑焰族奴隶团长', '黑焰族执行者', '尤鲁侃部队', '哈侃部队', '奴隶团长的旗帜', '执行者的旗帜', '黑焰族邪灵魔', '黑焰族刽子手', '黑焰族族长', '马候部队', '拉侃部队', '邪灵魔的旗帜', '刽子手的旗帜', },
            ['半兽人遗迹1层'] = { '妖华追随者', '库鲁茨部下', '半兽人训练场', '女王的还生', '处决背德者', '憎恶半兽人之人', '妖华的饰品', '库鲁茨的手爪', '猎人的武器', '野兽王部下', '吭吭部下', '野兽中的野兽', '最强猎人', '野兽王的陷阱', '吭吭的毛' },
            ['半兽人遗迹2层'] = { '车道拉部下', '付宇部下', '真正的打手', '邪恶的法师', '车道拉的指令', '付宇的指令', '被抢走的铁矿石', '乌洛部下', '库夏部下', '军长的权威', '被遗忘的征服者', '乌洛的指令', '库夏的指令' },
            ['牛魔神殿1层'] = { '残忍的逃兵', '邪恶变节者', '流浪汉残兵', '逃兵头领', '变节者头领', '残兵头领', '诡秘的庭院', '黒师会的存在', '如门帮的存在', '黒师会团长' },--, '如门帮团主'
            ['牛魔神殿2层'] = { '被占领的庭院', '被诅咒的亡灵', '邪法师的诅咒', '庭院破坏者', '被诅咒之人', '玄黑邪术师', '沃玛的秘密监牢', '游荡的冤魂', '灵魂收集家', '鬼城之恨', '亡灵支配者', '灵魂收集者', '鬼城之主' },
            ['牛魔神殿3层'] = { '可疑的厨师', '真实存在的食人群', '千夫长部下', '残忍的厨师', '食人魔队长', '千夫长', '阻挠登基仪式', '监牢看守人', '终极拷问', '牛鬼王部下', '牢头', '拷问专家', '牛鬼王' },
        },
        ['迷宫'] = {
            ['比奇迷宫1层'] = { '豚豚崽随从', '半兽人中副将随从', '半兽人大队长随从', '远古豚豚崽', '远古半兽人中副将', '远古半兽人大队长', '警卫兵的指令', '警戒兵的指令', '巡查队的指令', '半兽人大副将随从', '瓜德随从', '远古豚豚大副将', '半兽人大神将', '侦查兵的指令', '战斗兵的指令' },
            ['比奇迷宫2层'] = { '远古守卫队长', '远古走私队长', '远古打手队长', '远古狩猎队长', '守卫兵的宝物', '走私犯的宝物', '打手的宝物', '半兽人大神将', '猎人的宝物', '守护兵的宝物', '守卫队长随从', '走私队长随从', '打手队长随从', '狩猎队长随从', '守护队长随从', },
            ['比奇迷宫3层'] = { '恣睢队长随从', '盗墓队长随从', '掠夺队长随从', '恣睢队长', '盗墓队长', '掠夺队长', '追击队长随从', '精英半兽人群', '追击队长', '精英半兽人', },
            ['比奇迷宫4层'] = {},
            ['牛魔迷宫1层'] = { '沃玛魔兵随从', '沃玛法师随从', '秘密沃玛法师', '秘密沃玛魔兵', '警戒兵的指令', '警卫兵的指令', '传令人', '沃玛甲兵的随从', '沃玛士兵随从', '秘密沃玛甲兵', '秘密沃玛士兵', '巡查队的指令', '侦察兵的指令', '加勒达尔随从', '牛魔大神将', '战斗兵的指令' },
            ['牛魔迷宫2层'] = { '黑鬼团长随从', '白鬼团长随从', '秘密黑鬼团长', '秘密白鬼团长', '绿鬼团长随从', '黄鬼团长随从', '秘密绿鬼团长', '秘密黄鬼团长', '牛魔大神将', '琴高随从' },
            ['牛魔迷宫3层'] = { '铲除红鬼团', '铲除青鬼团', '红鬼团长', '青鬼团长', '铲除紫鬼团', '紫鬼团长', '铲除暗鬼团', '暗鬼团长', '铲除沃玛队', '沃玛队' },
            ['牛魔迷宫4层'] = {},
        },
    },
    WEITUO_QUEST = {
        ['银杏谷'] = { '巨型圆花', '勉强的工作', '宝物的气息', '临危的银杏谷', '为了出人头地', '狂人的痕迹', '长生不老材料', },--'名胜渗透之毒',
        ['比奇城龙楼会'] = { '规定的礼物', '难忘的记忆',  '底层人的隐情', '莫夜的宝物', '说书人的嘱托', },--'酒是仇人',
        ['比奇城'] = { '比奇城通缉犯', '隐秘的调查1', '隐秘的调查2', '隐秘的调查3', '隐秘的调查4', '隐秘的调查5', },
        ['比奇县'] = {  },
        ['沃玛森林'] = {  },
    }

}

local this = quest_res


function this.get_weituo_name_list()
    local main_quest_idx = 0

    local main_quest_list = quest_res.MAIN_QUEST
    -- 主线任务名称
    local main_task_name = quest_unit.get_main_quest_name()
    for i = 1, #main_quest_list do
        if main_quest_list[i].name == main_task_name then
            main_quest_idx = i
            break
        end
    end
    local side_quest_name_list = {}
    local side_quest_list = quest_res.WEITUO_QUEST
    if main_quest_idx >= 29 then
        local need_do_map = {
            '银杏谷',
            '比奇城龙楼会',
            '比奇城',
            '比奇县',
            '沃玛森林',
        }
        for _, v in pairs(side_quest_list) do
            for i = 1, #need_do_map do
                if _ == need_do_map[i] then
                    for j = 1, #v do
                        side_quest_name_list[v[j]] = true
                    end
                end
            end
        end
    elseif main_quest_idx >= 24 then

    elseif main_quest_idx >= 17 then
        local need_do_map = {
            '银杏谷',
        }
        for _, v in pairs(side_quest_list) do
            for i = 1, #need_do_map do
                if _ == need_do_map[i] then
                    for j = 1, #v do
                        side_quest_name_list[v[j]] = true
                    end
                end
            end
        end
    end
    return side_quest_name_list
end

function this.get_side_name_list()
    local main_quest_idx = 0

    local main_quest_list = quest_res.MAIN_QUEST
    -- 主线任务名称
    local main_task_name = quest_unit.get_main_quest_name()
    for i = 1, #main_quest_list do
        if main_quest_list[i].name == main_task_name then
            main_quest_idx = i
            break
        end
    end
    local side_quest_name_list = {}
    local side_quest_list = quest_res.SIDE_QUEST
    if main_quest_idx >= 30 then
        local need_do_map = {
            '银杏谷',
            '比奇城后巷',
            '比奇县',
            '半兽古墓1层',
            '半兽古墓2层',
            '半兽人遗迹1层',
            '半兽人遗迹2层',
            '比奇迷宫1层',
            '比奇迷宫2层',
            '沃玛森林',
            '牛魔神殿1层',
          --  '牛魔神殿2层',
       --     '牛魔神殿3层',
            '牛魔迷宫1层',
         --   '牛魔迷宫2层',
        }
        for _, v in pairs(side_quest_list) do
            for i = 1, #need_do_map do
                if v[need_do_map[i]] then
                    for j = 1, #v[need_do_map[i]] do
                        side_quest_name_list[v[need_do_map[i]][j]] = true
                    end
                end
            end
        end

    elseif main_quest_idx >= 24 then
        local need_do_map = {
            '银杏谷',
            '比奇城后巷',
            '比奇县',
            '半兽古墓1层',
            '半兽古墓2层',
            '半兽人遗迹1层',
            '半兽人遗迹2层',
            '比奇迷宫1层',
            '比奇迷宫2层',
        }
        for _, v in pairs(side_quest_list) do
            for i = 1, #need_do_map do
                if v[need_do_map[i]] then
                    for j = 1, #v[need_do_map[i]] do
                        side_quest_name_list[v[need_do_map[i]][j]] = true
                    end
                end
            end
        end
    elseif main_quest_idx >= 18 then
        local need_do_map = {
            '银杏谷',
            '比奇城后巷',
            '比奇县',
            '半兽古墓1层',
            '半兽古墓2层',
        --    '半兽人遗迹1层',
         --   '半兽人遗迹2层',
            '比奇迷宫1层',
        }
        for _, v in pairs(side_quest_list) do
            for i = 1, #need_do_map do
                if v[need_do_map[i]] then
                    for j = 1, #v[need_do_map[i]] do
                        side_quest_name_list[v[need_do_map[i]][j]] = true
                    end
                end
            end
        end
    elseif main_quest_idx >= 18 then
        local need_do_map = {
            '银杏谷',
            '比奇城后巷',
            '比奇县',
            '半兽古墓1层',

        }
        for _, v in pairs(side_quest_list) do
            for i = 1, #need_do_map do
                if v[need_do_map[i]] then
                    for j = 1, #v[need_do_map[i]] do
                        side_quest_name_list[v[need_do_map[i]][j]] = true
                    end
                end
            end
        end
    elseif main_quest_idx > 14 or  (main_quest_idx == 14 and quest_unit.get_main_quest_idx() >= 18) then
        local need_do_map = {
            '银杏谷',
            '比奇城后巷',
        }
        for _, v in pairs(side_quest_list) do
            for i = 1, #need_do_map do
                if v[need_do_map[i]] then
                    for j = 1, #v[need_do_map[i]] do
                        side_quest_name_list[v[need_do_map[i]][j]] = true
                    end
                end
            end
        end
    elseif main_quest_idx >= 12 then
        local need_do_map = {
            '银杏谷',
        }
        for _, v in pairs(side_quest_list) do
            for i = 1, #need_do_map do
                if v[need_do_map[i]] then
                    for j = 1, #v[need_do_map[i]] do
                        side_quest_name_list[v[need_do_map[i]][j]] = true
                    end
                end
            end
        end
    end
    return side_quest_name_list
end

-------------------------------------------------------------------------------------
-- 返回对象
return quest_res

-------------------------------------------------------------------------------------