-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   zengluolu
-- @email:    1819@qq.com
-- @date:     2023-10-16
-- @module:   skill_res 
-- @describe: 物品资源
-- @version:  v1.0


-------------------------------------------------------------------------------------
-- 任务模块资源
---@class skill_res
local skill_res = {
    SKILL_INFO = {
        [1] = { { name = '狂风斩', cd = 45, mp = 395, 1300 },
                { name = '大地崩裂', cd = 19, mp = 349, 1300 },
                { name = '反击斩', cd = 26, mp = 446, 0 },
                { name = '一刀两断', cd = 17, mp = 279, 1300 },
                { name = '铁山靠', cd = 24, mp = 446, 1300 },
                { name = '空破斩', cd = 26, mp = 209, 1300 },
                { name = '狮吼功', cd = 39, mp = 446, 1300 },
                { name = '捕链掌', cd = 40, mp = 200, 1300 },
                { name = '半月弯刀', cd = 20, mp = 200, 1300 },
        },
        [2] = {
            { name = '火球术', cd = 12, mp = 186, 1800 },
            { name = '寒冰掌', cd = 16, mp = 237, 1800 },
        },
        [3] = {
            { name = '御剑雨', cd = 21, mp = 400, 1500 },
            { name = '御剑术', cd = 20, mp = 400, 1500 },
            { name = '太极拳', cd = 36, mp = 400, 1500 },
            { name = '灵魂火符', cd = 21, mp = 400, 1500 },
        },
        [4] = {
            { name = '心眼', cd = 31, mp = 255, 9999 },
            { name = '速射', cd = 13, mp = 186, 1300 },
            { name = '疾风腿', cd = 21, mp = 302, 2000 },
            { name = '幻影矢', cd = 23, mp = 330, 1300 },
            { name = '破功歼', cd = 29, mp = 275, 3000 },
            { name = '闪光矢', cd = 36, mp = 525, 1300 },
            { name = '追魂箭', cd = 39, mp = 800, 2000 },
        },
        [5] = {
            { name = '八方风雨', cd = 45, mp = 325, 1300 },
            { name = '霸王击', cd = 39, mp = 426, 1300 },
            { name = '风山壁', cd = 46, mp = 395, 1300 },
            { name = '追风闪', cd = 25, mp = 325, 1300 },
            { name = '偃月击', cd = 17, mp = 325, 1300 },
            { name = '无上脚', cd = 19, mp = 325, 1300 },
        },
    },

    NORMAL_SKILL = {
        [1] = {
            kill_dist = 1300, skill_id = 0x272E, skill_ticket = 480
        },
        [2] = {
            kill_dist = 1800, skill_id = 0x00004E34, skill_ticket = 400
        },
        [3] = {
            kill_dist = 1300, skill_id = 0x00007558, skill_ticket = 500
        },
        [4] = {
            kill_dist = 3000, skill_id = 0x9C68, skill_ticket = 310
        },
        [5] = {
            kill_dist = 1300, skill_id = 0x0000C364, skill_ticket = 480
        },
    },

}

local this = skill_res




-------------------------------------------------------------------------------------
-- 返回对象
return skill_res

-------------------------------------------------------------------------------------